{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft": "Warning",
      "Microsoft.Hosting.Lifetime": "Information"
    }
  },
  "Logger": {
    "FilePath": "C:\\TestFiles\\JDInvoiceManager\\",
    "FileName": "Log.sqlite",
    "FailsafeFileName": "Log.txt"
  },
  "Site": {
    "ServerURL": "http://localhost:59396/",
    "ClientCode": ""
  },
  "AllowedHosts": "*",
  "Services": [
    {
      "id": "crm",
      "name": "CRM",
      "group": "Aplicaciones de negocio",
      "groupid": "aplicaciones-de-negocio",
      "icon": "fal fa-users-cog",
      "preview": "Te ayudamos a administrar las relaciones que mantienes con los clientes que ya tienes y con los que aún son potenciales para generar oportunidades de venta.",
      "fullname": "CRM (Customer Relationship Management)",
      "fulltext": [
        "Con la llegada de la tecnología en todos los ambitos de un negocio, un CRM es una de las facetas más escenciales para el manejo de una empresa hoy en día.",
        "Un CRM es una herramienta que facilita la administración de las relaciones entre clientes y empresas para asegurar el éxito de un negocio. En JD Solutions, nuestros especialistas generan soluciones CRM que cumplirán las siguientes necesidades:"
      ],
      "jdlist": [
        "Integración con sistemas ya existentes",
        "Minimización de costos de producción innecesarios",
        "Seguimiento fidedigno de los requerimientos de negocios en marketing, gestión comercial o servicios de postventa"
      ]
    },
    {
      "id": "erp",
      "name": "ERP",
      "group": "Aplicaciones de negocio",
      "groupid": "aplicaciones-de-negocio",
      "icon": "fal fa-chart-network",
      "preview": "Colaboramos contigo para gestionar actividades diarias como operaciones de suministro, procesos financieros o de contabilidad. oportunidades de venta.",
      "fullname": "ERP (Enterprise Resource Planning)",
      "fulltext": [
        "Tenemos la experiencia para actualizar tecnológicamente los procesos financieros y operativos de tu negocio a través de soluciones amigables con tus usuarios finales. Con nuestra amplia experiencia en servicios de ERP, nosotros podemos hacer realidad los resultado deseado para que pueda prosperar en este mundo donde la tecnología es una necesidad.",
        "Un ERP puede incluir módulos para revisión de desempeño empresarial que ayuden a planear, presupuestar y reportar sobre los estados financieros de la operación. Se usa para administrar actividades diarias como: operaciones de suministro o contabilidad. Puede incluir módulos para revisión de desempeño empresarial ayudando a planear, presupuestar y reportar sobre los estados financieros de la operación."
      ],
      "jdlist": []
    },
    {
      "id": "appweb",
      "name": "APLICACIONES WEB",
      "group": "Aplicaciones de negocio",
      "groupid": "aplicaciones-de-negocio",
      "icon": "fal fa-code",
      "preview": "Desarrollamos aplicaciones y sitios web para internet y/o intranet en todo rubro: desde sitios publicitarios, hasta plataformas de gestión de procesos de negocio.",
      "fullname": "Aplicaciones web",
      "fulltext": [ "Nuestros desarrolladores web se dedican a mantener los mejores estándares de ingeniería web:" ],
      "jdlist": [
        "Net",
        "Javascript",
        "HTML",
        "CSS",
        "React",
        "Angular"
      ],
      "bottomtext": "El equipo entrega sitios y apps atractivos, responsivos y eficientes enfocados en ofrecer una buena experiencia de usuario y crecer la interacción de nuevas personas."
    },
    {
      "id": "app-movil",
      "name": "SOFTWARE MÓVIL",
      "group": "Aplicaciones de negocio",
      "groupid": "aplicaciones-de-negocio",
      "icon": "fal fa-mobile-android-alt",
      "preview": "Creamos aplicaciones nativas para dispositivos móviles iOS o Android de alta usabilidad, aplicables en todos los segmentos de negocio que las necesiten.",
      "fullname": "Software móvil",
      "fulltext": [
        "Ofrecemos un ciclo completo de diseño, integración y manejo de servicios de aplicaciones tanto para clientes como de uso interno con el fin de aumentar la productividad de los negocios.",
        "Generamos el concepto de cada aplicación hasta publicarla y darle soporte continuo durante su vida.",
        "No hay duda de que una app móvil desarrollada con la estrategia correcta puede tener un retorno de inversión muy alto cuando se trata de atraer clientes o usuarios, pero con la mayoría de las personas teniendo la expectativa de que una aplicación móvil sea más sencilla de usar que un sitio web o una aplicación de escritorio es importante que esto sea visualizado de manera correcta desde un inicio.",
        "Las metas que visualizamos para una app móvil son:"
      ],
      "iconlist": [
        {
          "icon": "fal fa-bullseye-pointer",
          "title": "Naturalmente intuitiva",
          "text": "A las personas no le gusta una experiencia compleja aún en las mejores condiciones, menos estando en una pantalla pequeña. Nosotros nos aseguramos que su app haga todos los procesos planeados de manera sencilla y amigable al usuario."
        },
        {
          "icon": "fal fa-grin-beam",
          "title": "Experiencia de usuario cautivante",
          "text": "Este punto se encuentra de la mana con la simplicidad. Si la app no ofrece una gran experiencia de usuario y hace más sencillo que el cliente haga alguna tarea no hay garantía de que la vuelva a usar."
        },
        {
          "icon": "fal fa-stopwatch",
          "title": "Tiempos de carga cortos",
          "text": "En la época que vivimos, se espera que todo se maneje en tiempo real, si tu nueva app no carga y reacciona de manera rápida, la gente se cambiará a alguna otra alternativa."
        }
      ]
    },
    {
      "id": "software-a-la-medida",
      "name": "SOFTWARE A LA MEDIDA",
      "group": "Aplicaciones de negocio",
      "groupid": "aplicaciones-de-negocio",
      "icon": "fal fa-phone-laptop",
      "preview": "Desarrollamos software que cumpla con las necesidades de cada negocio, así los clientes no tienen que adaptarse a los productos que ya existen en el mercado.",
      "fullname": "Software a la medida",
      "fulltext": [
        "Las compañías hoy en día buscan un software para resolver sus problemas y potenciar su crecimiento enfrentan un dilema: invertir en una solución de software a la medida o comprar un producto existente del mercado? En JD Solutions, tenemos años de experiencia analizando a profundidad los retos, procesos y necesidades de nuestros clientes para cumplir sus metas con un software a la medida.",
        "En años recientes las soluciones de software a la medida han incrementado en el mercado debido a la tranquilidad que brindan a los usuarios, ya que esto permite al cliente no tener que adaptarse a reglas establecidas por productos en el mercado, sino trabajar con un producto adapatado a sus necesidades."
      ]
    },
    {
      "id": "migracion-base-de-datos",
      "name": "MIGRACIONES DE BASES DE DATOS",
      "group": "Integración de sistemas",
      "groupid": "integracion-de-sistemas",
      "icon": "fal fa-database",
      "preview": "Te ayudamos a mover datos, aplicaciones o cualquier otro elemento de negocio a un ambiente de cómputo en la nube más amigable para tu negocio y tu día a día.",
      "fullname": "Migración de bases de datos",
      "fulltext": [
        "Los datos de operación son uno de los activos claves de un negocio. Las migraciones se presentan en escenarios variados como los siguientes:"
      ],
      "jdlist": [
        "La empresa está actualizando un sistema antiguo y se necesita la información del sistema migrada a su sucesor",
        "La información necesita sincronizarse entre un sistema viejo y uno nuevo para sustituir de inmediato un sistema viejo",
        "Se compró una nueva aplicación que requiere información de un sistema que ya existe en el proceso de un negocio",
        "La compañía se fusionó con otra y es necesario migrar la información a los sistemas de la compañía madre",
        "Se está realizando un cambio a ambientes en la nube para que los sistemas puedan escalar de mejor manera",
        "Se está realizando un cambio de servidor y hay que migrar la información al servidor nuevo"
      ]
    },
    {
      "id": "migracion-cloud",
      "name": "MIGRACIONES A CLOUD",
      "group": "Integración de sistemas",
      "groupid": "integracion-de-sistemas",
      "icon": "fal fa-cloud-upload",
      "preview": "Nuestro trabajo consiste en gestionar la migración de los datos, la actualización de aplicaciones o el cambio de ambientes de un sistema viejo a uno nuevo.",
      "fullname": "Migraciones a cloud",
      "fulltext": [
        "Movemos una aplicación de software de un ambiente a otro (de un servidor en sitio o un servidor dedicado a un ambiente virtual de un proveedor de un servicio en la nube, o de un ambiente público en la nube a un ambiente privado en la nube).",
        "Algunos de los beneficios de migrar a la nube:"
      ],
      "iconlist": [
        {
          "icon": "fal fa-sort-size-up",
          "title": "Escalabilidad",
          "text": "Un incremento en el tráfico de usuarios o en el uso del sistema en ciertas temporadas del año puede provocar que la infraestructura actual no dé el ancho. Los proveedores de servicios en la nube sólo cobran por los recursos que utiliza una aplicación y permite crecer dinámicamente."
        },
        {
          "icon": "fal fa-stopwatch",
          "title": "Velocidad y eficiencia",
          "text": "Migrar su aplicación a la nube quiere decir que puede desplegar actualizaciones más rápido, incrementando la eficiencia de su negocio. Los servicios pueden ser desplegados rápidamente a través de actualizaciones y estar listos para ser usados por sus usuarios en minutos."
        },
        {
          "icon": "fal fa-calendar-check",
          "title": "Mantenimiento",
          "text": "Migrando su solución a la nube, el proveedor del servicio en la nube es el encargado de realizar el mantenimiento necesario en la infraestructura, así el cliente no tiene que realizar tareas manuales de actualización costosas en tiempo y dinero."
        }
      ]
    },
    {
      "id": "webservice",
      "name": "WEBSERVICE/API",
      "group": "Integración de sistemas",
      "groupid": "integracion-de-sistemas",
      "icon": "fal fa-cogs",
      "preview": "Desarrollamos integraciones útiles, así como una comunicación sencilla entre múltiples aplicaciones independientes de plataforma o lenguaje de las mismas.",
      "fullname": "Webservice/API",
      "fulltext": [
        "Ofrecemos servicios web que permiten una integración sencilla y eficiente con las aplicaciones existentes de una empresa. Según los requerimientos específicos, ayudamos a simplificar los procesos de negocios mientras generamos desarrollos robustos, seguros y de confianza.",
        "Nuestros desarolladores son expertos en fragmentar aplicaciones monolíticas para lograr estabilidad y extensibilidad, así como en la creación de APIs y prácticas de administración clave para aplicaciones orientadas a servicios.",
        "Casi todo nuestro desarrollo de API es RESTful, usando protocolos HTTP con JSON o en ocasiones con payloads XML. Además de desarrollar, y desde luego consumir, APIs, también ayudamos a nuestros clientes en en la planeación necesaria para adoptar un modelo de microservicios y software modular.",
        "El desarrollo de APIs es crítico no solo para exponer la información necesaria, si no también para que las aplicaciones sean fáciles de actualizar cuando surge la necesidad. Siendo más eficiente adoptar este modelo que mantener aplicaciones monolíticas, nuestros clientes usan nuestra expertise para el desarrollo de webservices y APIs."
      ]
    },
    {
      "id": "ar",
      "name": "REALIDAD AUMENTADA",
      "group": "Advanced Tech",
      "groupid": "advanced-tech",
      "icon": "fal fa-dice-d8",
      "preview": "Generamos experiencias interactivas en el mundo real con objetos que se modifican con algún dispositivo, para cualquier tipo de necesidad y de negocio.",
      "fullname": "Realidad aumentada",
      "fulltext": [
        "Con la cambiante mercadotecnia de hoy en día, es complicado para los negocios identificar maneras diferentes y únicas de poder llegar a un cliente.",
        "Con realidad aumentada, ayudamos a nuestros clientes a crear experiencias intuitivas, veloces e irrepetibles que incrementen su alcance de prospección de usuarios para cubrir las necesidades de difusión y marketing de cada negocio.",
        "Nuestro equipo de diseño y desarrollo de productos digitales aprecia los matices de trabajar en tres dimensiones o cuatro, si incluimos el tiempo, que por supuesto tiene sentido en el undo dinámico de AR.",
        "Presentar una experiencia de realidad aumentada interactiva requiere capacidades que van mucho más allá de los gráficos en movimiento y efectos visuales regulares. Los desafíos técnicos son importantes. Las experiencias de realidad aumentada y realidad virtual acaparan la CPU y la GPU, por lo que la experiencia más rica no siempre es la correcta: conocer a su audiencia y su hardware es clave.",
        "No somos solo diseñadores y desarrolladores, somos investigadores que nos aseguramos de tener un conocimiento experto de las tecnologías emergentes. Estamos experimentando con Unity, creando rápidamente prototipos para la realidad virtual e invirtiendo en el futuro de lo digital para nuevas capacidades de realidad mixta."
      ],
      "highlightedtext": "La computación holográfica lleva nuestro lienzo de diseño de nuestros teléfonos y pantallas al mundo que nos rodea, algo bastante poderoso.",
      "bottomtext": "Ampliamos nuestros principios de diseño básicos para crear un trabajo de realidad aumentada sin interrupciones. La creación rápida de prototipos sigue siendo parte de nuestro proceso, pero se vuelve más práctica con modelos y espacios transformados. Diseñar para AR requiere experimentación, y en JD Solutions somos pioneros constantemente."
    },
    {
      "id": "bi",
      "name": "DATA SCIENCE, BUSINESS INTELLIGENCE",
      "group": "Advanced Tech",
      "groupid": "advanced-tech",
      "icon": "fal fa-analytics",
      "preview": "Analizamos la información de negocio de una compañía para tomar decisiones comerciales informadas que resulten en soluciones funcionales para los clientes.",
      "fullname": "Business Intelligence",
      "fulltext": [
        "Ofrecemos varias soluciones de servicios BI para ayudar a las empresas a tener una visión clara en la toma de decisiones para ahorrar costos, aumentar la eficiencia y el crecimiento del negocio. Recolectamos, organizamos y analizamos los datos para que la información correcta le llegue a la persona correcta en el momento correcto.",
        "BI es un proceso impulsado por tecnología para analizar datos y entregar información que permite a ejecutivos, managers y trabajadores realizar decisiones de negocio de una manera más informada. Como parte del proceso de BI, ayudamos a nuestros clientes a colectar la información que puede ser útil dentro de sistemas internos de TI, la peparamos para el análisis, realizamos las consultas para poder crear amenas visualizaciones.",
        "Adicionalmente usando Power BI se generan reportes que contienen los resultados para que los usuarios de negocio tengan acceso al análisis en una interfaz amigable y sencilla de manejar, de esta manera pueden realizar mejores decisiones sobre la operación y tener una mejor planeación estratégica."
      ]
    },
    {
      "id": "consultoria-de-software",
      "name": "CONSULTORÍA DE SOFTWARE (AUTOMATIZACIÓN DE PROCESOS)",
      "group": "Servicios profesionales",
      "groupid": "servicios-profesionales",
      "icon": "fal fa-compass",
      "preview": "Analizamos los procesos de negocio de cada uno de nuestros clientes y les mostramos un panorama de mejora, así como de automatización de procesos ágiles.",
      "fullname": "Consultoría de software",
      "fulltext": [
        "Nuestra consultoría ayuda a automatizar y digitalizar las operaciones de nuestros clientes, así como a optimizar sus portafolios de software e implementar las tecnologías más nuevas para impulsar el crecimiento de cualquier negocio.",
        "Use la expertise y el conocimiento técnico de las mejores mentes de JD Solutions para crear una detallada estrategia para poder tener una transformación digital y tecnológica de su organización que se alinee a las metas de su negocio."
      ]
    },
    {
      "id": "staffing",
      "name": "OUTSOURCING (STAFFING, BODY LEASING, DEDICATED DEVELOPMENT TEAM)",
      "group": "Servicios profesionales",
      "groupid": "servicios-profesionales",
      "icon": "fal fa-users-class",
      "preview": "Todos los expertos de nuestra base se dedican a planear o ejecutar actividades ideales enfocadas en cada una de las empresas que contrate nuestros servicios.",
      "fullname": "Outsourcing",
      "subtitle": "Staffing, Body Leasing, Dedicated Development Team",
      "fulltext": [
        "Nos convertimos en una extensión y aliados del área de IT de nuestros clientes con el fin de incrementar sus capacidades de desarrollo. Nos comprometemos a lo siguiente:"
      ],
      "jdlist": [
        "Usar un ambiente de desarrollo estándar",
        "Entregar un código desarrollado en sus instalaciones",
        "Transferir la propiedad intelectual",
        "Generar un código reusable",
        "Ofrecer una solución de principio a fin"
      ],
      "bottomtext": "Haciendo uso de nuestra experiencia profesional, puedes incrementar la capacidad de desarrollo para tu negocio sin poner estrés adicional en el manejo del proyecto o en el departamento de desarrollo, ya que trabajamos de la mano con nuestros ellos como un solo equipo."
    },
    {
      "id": "ui-ux",
      "name": "DISEÑO UI / UX",
      "group": "Servicios profesionales",
      "groupid": "servicios-profesionales",
      "icon": "fal fa-lightbulb-on",
      "preview": "Creamos interfaces de software que buscan exponenciar la usabilidad y ofrecer experiencias de usuario satisfactorias para nuestros clientes y sus usuarios.",
      "fullname": "Diseño UI / UX",
      "fulltext": [
        "Nuestro equipo establece un proceso claro de diseño; desarrollamos maquetas a fin de escuchar la retroalimentación de los usuarios; cumplimos con los plazos establecidos, y ofrecemos un resultado de excelente calidad. En JD Solutions nos comprometemos en elaborar un producto sencillo, atractivo y eficaz para todos los usuarios de nuestros clientes."
      ]
    }
  ],
  "Email": {
    "Port": "587",
    "Host": "smtp.gmail.com",
    "MailUser": "itsurfermail@gmail.com",
    "Mail": "itsurfermail@gmail.com",
    "MailName": "Repositorio de facturas",
    "Pass": "1tsurf3r2",
    "EnableSSL": true,
    "UseDefaultCredentials": false,
    "AssignServerCertificateValidationCallback": false,
    "DeliveryMethod": false,
    "OnlyDebugMailMode": false,
    "DebugMail": "oscarprograb@outlook.es",
    "IngoreAllEmailRequests": false,
    "LogEmailResult": false,
    "LogEmailBody": false
  }
}
